simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
static volatile uint8  rx_state       = 0u;
static volatile uint8  rx_cmd         = 0u;
static volatile uint8  rx_p1          = 0u;
static volatile uint8  rx_p2          = 0u;
static volatile uint8  watchdog_rx    = 0u;

static          uint8  g_esp_connected  = 0u;
static          uint8  g_nv_ready       = 0u;
static          uint8  g_last_calibration_ok = 0u;

/* Mapa de timers fixed (3 en uso; Timer_3 quedo LIBRE y puede eliminarse del
 * TopDesign — ver docs/psoc_supermaquina_handoff.md):
 *   Timer   : watchdog del parser UART RX (concurrente con todo lo demas).
 *   Timer_1 : ping boot/idle + tick de calibracion (nunca concurrentes:
 *             la calibracion detiene los pings antes de arrancar).
 *   Timer_2 : LED/esperas cortas + watchdog de captura (nunca concurrentes:
 *             la ventana de captura apaga LED/esperas). */
#define TIMER1_MODE_NONE       0u
#define TIMER1_MODE_BOOT_PING  1u
#define TIMER1_MODE_IDLE_PING  2u
#define TIMER1_MODE_CAL_TICK   3u

#define TIMER2_MODE_NONE          0u
#define TIMER2_MODE_BOOT_LED_OFF  1u
#define TIMER2_MODE_WAIT          2u
#define TIMER2_MODE_COMM_BLINK    3u
#define TIMER2_MODE_CAPTURE_WD    4u

static volatile uint32 g_timer1_remaining_counts = 0u;
static volatile uint8  g_timer1_mode             = TIMER1_MODE_NONE;
static volatile uint8  g_boot_ping_due           = 0u;
static volatile uint8  g_idle_ping_due           = 0u;
static volatile uint8  g_idle_ping_armed         = 0u;

static volatile uint32 g_timer2_remaining_counts = 0u;
static volatile uint8  g_timer2_mode             = TIMER2_MODE_NONE;
static volatile uint8  g_boot_led_off_due        = 0u;
static volatile uint8  g_timer2_wait_done        = 0u;
static volatile uint8  g_comm_blink_due          = 0u;
static volatile uint16 g_comm_blinks_remaining   = 0u;
static volatile uint8  g_comm_led_active         = 0u;
static volatile uint8  g_capture_wd_due          = 0u;

static volatile uint8  g_cal_timer_active        = 0u;
static volatile uint8  g_cal_progress_due        = 0u;
static volatile uint8  g_cal_watchdog_due        = 0u;
static volatile uint32 g_cal_progress_period_ms  = 0u;
static volatile uint32 g_cal_watchdog_remaining_ms = 0u;

/* Margen extra del watchdog de captura sobre la duracion nominal esperada. */
#define CAPTURE_WD_MARGIN_MS  1500u

/* superMaquina control/status map. */
#define CE_CTRL_ARM          0x01u
#define CE_CTRL_START_NOW    0x02u
#define CE_CTRL_STOP         0x04u
#define CE_CTRL_CLEAR_FLAGS  0x08u
#define CE_CTRL_USE_SYNC     0x10u
#define CE_CTRL_LOAD_BATCH_LO 0x20u
#define CE_CTRL_ENGINE_EN    0x40u
#define CE_CTRL_LOAD_BATCH_HI 0x80u

#define CE_CFG_SRC_MASK      0x03u
#define CE_CFG_SRC_RAW       0x00u
#define CE_CFG_SRC_FILTER    0x01u
#define CE_CFG_SRC_COMBINED  0x02u
#define CE_CFG_SRC_DEBUG     0x03u
#define CE_CFG_IRQ_BATCH_EN  0x04u
#define CE_CFG_IRQ_SYNC_EN   0x08u
#define CE_CFG_IRQ_ERROR_EN  0x10u
/* cfg[5..7] libres. Un contador de descarte FIR en Verilog no entro en los
 * 24 UDB (E2071): el descarte lo hace el ARM (g_fir_discard). */

#define CE_STATUS_IDLE       0x01u
#define CE_STATUS_ARMED      0x02u
#define CE_STATUS_SAMPLING   0x04u
#define CE_STATUS_DONE       0x08u
#define CE_STATUS_ERROR      0x10u
#define CE_STATUS_BUTTON     0x80u

#ifndef PSOC_SUPERMAQUINA_OWNS_DMA_IRQ
#define PSOC_SUPERMAQUINA_OWNS_DMA_IRQ 1u
#endif

#ifndef PSOC_SUPERMAQUINA_OWNS_SYNC_IRQ
#define PSOC_SUPERMAQUINA_OWNS_SYNC_IRQ 1u
#endif

#define CE_STATE_IDLE        0u
#define CE_STATE_ARMED       1u
#define CE_STATE_SAMPLING    2u
#define CE_STATE_DONE        3u
#define CE_STATE_ERROR       4u

static          uint8 g_ce_ctrl_level = 0u;
static          uint8 g_ce_cfg_level  = (CE_CFG_SRC_RAW | CE_CFG_IRQ_SYNC_EN | CE_CFG_IRQ_ERROR_EN);
static volatile uint8 g_ce_status     = CE_STATUS_IDLE;
static volatile uint8 g_ce_error      = 0u;
static volatile uint8 g_ce_state      = CE_STATE_IDLE;

/* -------------------------------------------------------------------------- */

static const uint8 g_ping_frame[4] = {
    0xABu, PSOC_CMD_PING, 0x00u, PSOC_CMD_PING
};

#define PSOC_REPORTED_SRATE_HZ 2929u

static void uart_send_ping(void)
{
    UART_PutArray(g_ping_frame, (uint8)sizeof(g_ping_frame));
}

static void uart_send_cfg_ack(uint8 cmd, uint8 val)
{
    uint8 frame[5u];
    frame[0] = 0xABu;
    frame[1] = PSOC_CMD_CFG_ACK;
    frame[2] = cmd;
    frame[3] = val;
    frame[4] = (uint8)(PSOC_CMD_CFG_ACK ^ cmd ^ val);
    UART_PutArray(frame, (uint8)sizeof(frame));
}

static void uart_send_fs_report(void)
{
    uint8 fs_lo = (uint8)((uint16)PSOC_REPORTED_SRATE_HZ & 0xFFu);
    uint8 fs_hi = (uint8)(((uint16)PSOC_REPORTED_SRATE_HZ >> 8u) & 0xFFu);
    uint8 frame[5u];
    frame[0] = 0xABu;
    frame[1] = PSOC_CMD_FS_REPORT;
    frame[2] = fs_lo;
    frame[3] = fs_hi;
    frame[4] = (uint8)(PSOC_CMD_FS_REPORT ^ fs_lo ^ fs_hi);
    UART_PutArray(frame, (uint8)sizeof(frame));
}

static void uart_send_diag(uint8 event, uint8 value)
{
#if PSOC_DIAG_ENABLE
    uint8 state = g_state;
    uint8 frame[6u];
    frame[0] = 0xABu;
    frame[1] = PSOC_CMD_DIAG_EVT;
    frame[2] = event;
    frame[3] = value;
    frame[4] = state;
    frame[5] = (uint8)(PSOC_CMD_DIAG_EVT ^ event ^ value ^ state);
    UART_PutArray(frame, (uint8)sizeof(frame));
    psoc_debug_print_evt(event, value, state);
#else
    (void)event;
    (void)value;
#endif
}

static uint8 diag_u16_sat(uint16 value)
{
    return (value > 255u) ? 255u : (uint8)value;
}

static uint16 capture_target_batches(void)
{
    uint16 n = g_n_batches;
    if (n == 0u || n > PSOC_CAPTURE_MAX_BATCHES) {
        n = PSOC_CAPTURE_MAX_BATCHES;
    }
    return n;
}

static uint8 capture_dump_pending(void)
{
    return (g_batches_sent < g_batches_captured) ? 1u : 0u;
}

static void capture_engine_refresh_status(void)
{
    g_ce_status = status_Read();
    g_ce_error  = error_Read();
    g_ce_state  = state_Read();
}

static void capture_engine_write_ctrl(void)
{
    ctrl_Write(g_ce_ctrl_level);
}

static void capture_engine_pulse(uint8 pulse)
{
    ctrl_Write((uint8)(g_ce_ctrl_level | pulse));
    ctrl_Write(g_ce_ctrl_level);
}

static void capture_engine_set_source(uint8 source)
{
    g_ce_cfg_level = (uint8)((g_ce_cfg_level & (uint8)~CE_CFG_SRC_MASK) |
                             (source & CE_CFG_SRC_MASK) |
                             CE_CFG_IRQ_SYNC_EN |
                             CE_CFG_IRQ_ERROR_EN);
    cfg_Write(g_ce_cfg_level);
}

static void capture_engine_set_enabled(uint8 enabled, uint8 use_sync)
{
    if (enabled) {
        g_ce_ctrl_level |= CE_CTRL_ENGINE_EN;
    } else {
        g_ce_ctrl_level &= (uint8)~CE_CTRL_ENGINE_EN;
    }

    if (use_sync) {
        g_ce_ctrl_level |= CE_CTRL_USE_SYNC;
    } else {
        g_ce_ctrl_level &= (uint8)~CE_CTRL_USE_SYNC;
    }

    capture_engine_write_ctrl();
}

static void capture_engine_reset_hw(void)
{
    reset_Write(1u);
    reset_Write(0u);
    capture_engine_refresh_status();
}

static void capture_engine_clear_flags(void)
{
    capture_engine_pulse(CE_CTRL_CLEAR_FLAGS);
    capture_engine_refresh_status();
}

