simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
/* Carga el objetivo de lotes en superMaquina. hw_target puede exceder los
 * lotes realmente almacenados (captura filtrada armada: +3 lotes para cubrir
 * las 63 muestras de retardo de grupo que el ARM descarta al arrancar). */
static void capture_engine_configure_target(uint16 hw_target)
{
    uint16 limit = (uint16)(hw_target - 1u);
    uint8 saved_cfg = g_ce_cfg_level;

    cfg_Write((uint8)(limit & 0xFFu));
    capture_engine_pulse(CE_CTRL_LOAD_BATCH_LO);
    cfg_Write((uint8)((limit >> 8u) & 0x01u));
    capture_engine_pulse(CE_CTRL_LOAD_BATCH_HI);
    cfg_Write(saved_cfg);
}

static uint8 capture_engine_source_from_stream(uint8 use_filter)
{
#if PSOC_RAMP_DEBUG_ENABLE
    if (g_debug_psoc) {
        return CE_CFG_SRC_DEBUG;
    }
#endif
    return (use_filter != 0u) ? CE_CFG_SRC_FILTER : CE_CFG_SRC_RAW;
}

static void psoc_prepare_capture_path(void)
{
    psoc_calibration_servo_abort();
    ADC_StopConvert();
    psoc_adc_select_capture_config();
    psoc_calibration_restore_capture_path();
}

static uint32 timer_ms_to_counts(uint32 ms)
{
    uint32 counts = ms * (uint32)TIMER_ILO_COUNTS_PER_MS;
    return (counts == 0u) ? 1u : counts;
}

static uint16 timer_take_chunk(volatile uint32 *remaining_counts)
{
    uint32 remaining = *remaining_counts;
    uint16 chunk;

    if (remaining == 0u) {
        return 0u;
    }
    if (remaining > TIMER_MAX_COUNTS) {
        chunk = (uint16)TIMER_MAX_COUNTS;
        *remaining_counts = remaining - TIMER_MAX_COUNTS;
    } else {
        chunk = (uint16)remaining;
        *remaining_counts = 0u;
    }
    return chunk;
}

static void timer1_start_next_chunk(void)
{
    uint16 chunk = timer_take_chunk(&g_timer1_remaining_counts);
    if (chunk == 0u) { return; }
    Timer_1_Stop();
    Timer_1_WritePeriod(chunk);
    Timer_1_WriteCounter(chunk);
    (void)Timer_1_ReadStatusRegister();
    isr_Timer_1_ClearPending();
    Timer_1_Start();
}

static void timer1_arm_ms(uint32 ms, uint8 mode)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_1_Stop();
    g_timer1_mode = mode;
    g_timer1_remaining_counts = timer_ms_to_counts(ms);
    timer1_start_next_chunk();
    CyExitCriticalSection(saved);
}

static void timer1_stop_quiet(void)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_1_Stop();
    (void)Timer_1_ReadStatusRegister();
    isr_Timer_1_ClearPending();
    g_timer1_remaining_counts = 0u;
    g_timer1_mode = TIMER1_MODE_NONE;
    CyExitCriticalSection(saved);
}

static void timer2_start_next_chunk(void)
{
    uint16 chunk = timer_take_chunk(&g_timer2_remaining_counts);
    if (chunk == 0u) { return; }
    Timer_2_Stop();
    Timer_2_WritePeriod(chunk);
    Timer_2_WriteCounter(chunk);
    (void)Timer_2_ReadStatusRegister();
    isr_Timer_2_ClearPending();
    Timer_2_Start();
}

static void timer2_arm_ms(uint32 ms, uint8 mode)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_2_Stop();
    g_timer2_mode = mode;
    g_timer2_remaining_counts = timer_ms_to_counts(ms);
    timer2_start_next_chunk();
    CyExitCriticalSection(saved);
}

static void timer2_stop_quiet(void)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_2_Stop();
    (void)Timer_2_ReadStatusRegister();
    isr_Timer_2_ClearPending();
    g_timer2_remaining_counts = 0u;
    g_timer2_mode = TIMER2_MODE_NONE;
    CyExitCriticalSection(saved);
}

/* Timer_3 ya no se usa: su rol (tick de calibracion) vive en Timer_1. El
 * componente puede eliminarse del TopDesign junto con isr_Timer_3. */
static void fixed_timers_init(void)
{
    Timer_Init();   Timer_initVar = 1u;   Timer_Stop();   (void)Timer_ReadStatusRegister();
    Timer_1_Init(); Timer_1_initVar = 1u; Timer_1_Stop(); (void)Timer_1_ReadStatusRegister();
    Timer_2_Init(); Timer_2_initVar = 1u; Timer_2_Stop(); (void)Timer_2_ReadStatusRegister();
    isr_Timer_ClearPending();
    isr_Timer_1_ClearPending();
    isr_Timer_2_ClearPending();
}

static void rx_watchdog_start(void)
{
    uint8 saved = CyEnterCriticalSection();
    watchdog_rx = 0u;
    Timer_Stop();
    Timer_WritePeriod((uint16)TIMEOUT_COUNTS);
    Timer_WriteCounter((uint16)TIMEOUT_COUNTS);
    (void)Timer_ReadStatusRegister();
    isr_Timer_ClearPending();
    Timer_Start();
    CyExitCriticalSection(saved);
}

static void rx_watchdog_stop(void)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_Stop();
    (void)Timer_ReadStatusRegister();
    isr_Timer_ClearPending();
    watchdog_rx = 0u;
    CyExitCriticalSection(saved);
}

static void idle_ping_schedule(void)
{
    g_idle_ping_due = 0u;
    g_idle_ping_armed = 1u;
    timer1_arm_ms(IDLE_PING_MS, TIMER1_MODE_IDLE_PING);
}

static void idle_ping_stop(void)
{
    if (g_timer1_mode == TIMER1_MODE_IDLE_PING) {
        timer1_stop_quiet();
    }
    g_idle_ping_due = 0u;
    g_idle_ping_armed = 0u;
}

static void comm_led_stop(void)
{
    if (g_timer2_mode == TIMER2_MODE_COMM_BLINK) {
        timer2_stop_quiet();
    }
    g_comm_led_active = 0u;
    g_comm_blink_due = 0u;
    g_comm_blinks_remaining = 0u;
}

/* ── Watchdog de captura (Timer_2, libre durante la ventana silenciosa) ──
 * Si superMaquina nunca llega a DONE (p.ej. ADC detenido, DMA sin disparos),
 * el equipo antes quedaba mudo para siempre. Ahora el ARM se despierta al
 * vencer la duracion nominal + margen y aborta con diagnostico. */
static uint32 capture_expected_ms(uint16 batches)
{
    /* 30 muestras/lote a ~2929 S/s ≈ 10.25 ms por lote. */
    return ((uint32)batches * (uint32)BATCH_SAMPLES * 1000u) /
           (uint32)PSOC_REPORTED_SRATE_HZ;
}

static void capture_watchdog_arm(void)
{
    uint32 ms = capture_expected_ms(capture_target_batches());
    g_capture_wd_due = 0u;
    timer2_arm_ms(ms + (ms >> 1u) + CAPTURE_WD_MARGIN_MS, TIMER2_MODE_CAPTURE_WD);
}

static void capture_watchdog_stop(void)
{
    if (g_timer2_mode == TIMER2_MODE_CAPTURE_WD) {
        timer2_stop_quiet();
    }
    g_capture_wd_due = 0u;
}

static void runtime_timers_stop_for_quiet_window(void)
{
    rx_watchdog_stop();
    idle_ping_stop();
    comm_led_stop();
}

