simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
/* Tick de calibracion sobre Timer_1: progreso periodico + watchdog global.
 * Nunca concurre con los pings (los callers detienen idle/boot ping antes). */
void psoc_cal_timer_start(uint32 progress_ms, uint32 watchdog_ms)
{
    uint8 saved = CyEnterCriticalSection();
    if (progress_ms == 0u) { progress_ms = 1u; }
    if (watchdog_ms == 0u) { watchdog_ms = progress_ms; }
    g_cal_progress_due = 0u;
    g_cal_watchdog_due = 0u;
    g_cal_progress_period_ms = progress_ms;
    g_cal_watchdog_remaining_ms = watchdog_ms;
    g_cal_timer_active = 1u;
    g_idle_ping_due = 0u;
    g_idle_ping_armed = 0u;
    g_boot_ping_due = 0u;
    timer1_arm_ms(progress_ms, TIMER1_MODE_CAL_TICK);
    CyExitCriticalSection(saved);
}

void psoc_cal_timer_stop(void)
{
    uint8 saved = CyEnterCriticalSection();
    g_cal_timer_active = 0u;
    g_cal_progress_due = 0u;
    g_cal_watchdog_due = 0u;
    g_cal_progress_period_ms = 0u;
    g_cal_watchdog_remaining_ms = 0u;
    if (g_timer1_mode == TIMER1_MODE_CAL_TICK) {
        timer1_stop_quiet();
    }
    CyExitCriticalSection(saved);
}

uint8 psoc_cal_timer_take_progress_due(void)
{
    uint8 due;
    uint8 saved = CyEnterCriticalSection();
    due = g_cal_progress_due;
    g_cal_progress_due = 0u;
    CyExitCriticalSection(saved);
    return due;
}

uint8 psoc_cal_timer_take_watchdog_due(void)
{
    uint8 due;
    uint8 saved = CyEnterCriticalSection();
    due = g_cal_watchdog_due;
    g_cal_watchdog_due = 0u;
    CyExitCriticalSection(saved);
    return due;
}

static void capture_reset_locked(uint16 stored_batches)
{
    g_batches_sent     = 0u;
    g_batches_captured = 0u;
    g_capture_done     = 0u;
    g_capture_wd_due   = 0u;
    g_dbg_cnt          = 0u;
    g_seq              = 0u;
    g_fir_discard      = 0u;
    g_capture_wr       = g_capture_raw;
    g_capture_end      = g_capture_raw + ((uint32)stored_batches * CAPTURE_BATCH_BYTES);
}

/* Reconstruye int32 signed a partir de 3 bytes LE (24 bits, extensión de signo) */
static int32 dma_buf_to_i24(const volatile uint8 *buf)
{
    uint32 u = (uint32)buf[0] | ((uint32)buf[1] << 8u) | ((uint32)buf[2] << 16u);
    return (u & 0x00800000UL) ? (int32)(u | 0xFF000000UL) : (int32)u;
}

/* ── Handlers de muestra de superMaquina ─────────────────────────────────────
 * El IRQ único de superMaquina llega una vez por muestra aceptada. Para no
 * decidir el modo en cada interrupción, el trabajo por muestra se resuelve
 * con un puntero a función que se fija al cambiar de modo:
 *   captura raw/filtrada : copiar 3 bytes crudos al puntero de escritura
 *                          (el alineado se difiere al volcado UART).
 *   captura debug        : rampa sintética paceada por el ADC real.
 *   bypass calibración   : alinear y publicar la muestra para calibration.c.
 *   armed-wait           : primer IRQ tras el sync — bookkeeping de la
 *                          transición ARMED→SAMPLING y cambio al handler de
 *                          captura elegido al armar.
 */
typedef void (*sm_sample_handler_t)(void);

static void sm_sample_noop(void)
{
}

static void sm_sample_capture_raw(void)
{
    volatile uint8 *dst = g_capture_wr;
    if (dst >= g_capture_end) { return; }
    dst[0] = g_dma_raw_buf[0];
    dst[1] = g_dma_raw_buf[1];
    dst[2] = g_dma_raw_buf[2];
    dst += SAMPLE_BYTES;
    g_capture_wr = dst;
    if (dst >= g_capture_end) { g_capture_done = 1u; }
}

static void sm_sample_capture_filt(void)
{
    volatile uint8 *dst;
    if (g_fir_discard != 0u) {
        /* Salidas del FIR previas al sync (retardo de grupo): descartar. */
        g_fir_discard--;
        return;
    }
    dst = g_capture_wr;
    if (dst >= g_capture_end) { return; }
    dst[0] = g_dma_filt_buf[0];
    dst[1] = g_dma_filt_buf[1];
    dst[2] = g_dma_filt_buf[2];
    dst += SAMPLE_BYTES;
    g_capture_wr = dst;
    /* El objetivo del hardware puede estar extendido (+3 lotes): el fin real
     * lo marca el llenado del buffer, no el DONE de superMaquina. */
    if (dst >= g_capture_end) { g_capture_done = 1u; }
}

#if PSOC_RAMP_DEBUG_ENABLE
static void sm_sample_capture_debug(void)
{
    volatile uint8 *dst = g_capture_wr;
    uint32 val;
    if (dst >= g_capture_end) { return; }
    val = g_dbg_cnt++ & 0x00FFFFFFu;
    dst[0] = (uint8)( val         & 0xFFu);
    dst[1] = (uint8)((val >>  8u) & 0xFFu);
    dst[2] = (uint8)((val >> 16u) & 0xFFu);
    dst += SAMPLE_BYTES;
    g_capture_wr = dst;
    if (dst >= g_capture_end) { g_capture_done = 1u; }
}
#endif

static void sm_sample_cal_raw(void)
{
    psoc_adc_note_isr_sample(
        psoc_adc_counts_right_aligned(dma_buf_to_i24(g_dma_raw_buf)));
}

static void sm_sample_cal_filt(void)
{
    psoc_adc_note_isr_filtered_sample(
        psoc_adc_counts_right_aligned(dma_buf_to_i24(g_dma_filt_buf)));
}

static volatile sm_sample_handler_t g_sm_sample_handler = sm_sample_noop;
/* Handler de captura elegido al armar; sm_sample_armed_wait lo instala al
 * detectar la transición ARMED→SAMPLING. */
static volatile sm_sample_handler_t g_sm_capture_handler = sm_sample_noop;

static sm_sample_handler_t capture_handler_for_source(uint8 source)
{
#if PSOC_RAMP_DEBUG_ENABLE
    if (source == CE_CFG_SRC_DEBUG) { return sm_sample_capture_debug; }
#endif
    if (source == CE_CFG_SRC_FILTER || source == CE_CFG_SRC_COMBINED) {
        return sm_sample_capture_filt;
    }
    return sm_sample_capture_raw;
}

static void sm_sample_armed_wait(void)
{
    /* Primer IRQ tras el sync (IRQ_SYNC_EN): superMaquina ya está muestreando.
     * No hay muestra que copiar todavía; solo bookkeeping de la ventana. */
    runtime_timers_stop_for_quiet_window();
    capture_watchdog_arm();
    g_state = PSOC_SAMPLING;
    g_sm_sample_handler = g_sm_capture_handler;
    uart_send_diag(PSOC_EVT_SYNC_RISE, CE_STATE_SAMPLING);
}

static void psoc_enter_sampling(uint8 debugMode)
{
    uint8 saved;
    uint8 source;
    uint16 target = capture_target_batches();
    ADC_StopConvert();
    runtime_timers_stop_for_quiet_window();
    saved = CyEnterCriticalSection();
#if PSOC_RAMP_DEBUG_ENABLE
    g_debug_psoc = debugMode ? 1u : 0u;
#else
    (void)debugMode;
    g_debug_psoc = 0u;
#endif
    capture_reset_locked(target);
    g_state = PSOC_SAMPLING;
    CyExitCriticalSection(saved);
    source = capture_engine_source_from_stream(g_stream_mode);
#if PSOC_RAMP_DEBUG_ENABLE
    g_capture_align = (source == CE_CFG_SRC_DEBUG) ? 0u : 1u;
#else
    g_capture_align = 1u;
#endif
    capture_engine_configure_target(target);
    /* start-now: el FIR viene alimentado en bypass, historia caliente — sin
     * descarte de retardo de grupo. */
    capture_engine_set_source(source);
    g_sm_capture_handler = capture_handler_for_source(source);
    g_sm_sample_handler = g_sm_capture_handler;
    capture_engine_set_enabled(1u, 0u);
    capture_engine_clear_flags();
    capture_watchdog_arm();
    capture_engine_pulse(CE_CTRL_START_NOW);
    if (g_n_batches > PSOC_CAPTURE_MAX_BATCHES) {
        /* Pedido real recortado al cap físico — avisar en vez de truncar en
         * silencio (la web puede así informar la duración real soportada). */
        uart_send_diag(PSOC_EVT_CAPTURE_CLAMPED, diag_u16_sat(g_n_batches));
    }
    uart_send_diag(PSOC_EVT_SAMPLING_START, diag_u16_sat(target));
    ADC_StartConvert();
}

