simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
/* Fallbacks legacy (solo compilados con PSOC_SUPERMAQUINA_OWNS_DMA_IRQ=0,
 * TopDesign viejo con ISRs de DMA separadas): despachan al mismo handler. */
CY_ISR(isr_DMA_DelSig_RAM_Handler)
{
    g_sm_sample_handler();
}

CY_ISR(isr_DMA_Filter_RAM_Handler)
{
    g_sm_sample_handler();
}

CY_ISR(isr_Timer)
{
    (void)Timer_ReadStatusRegister();
    Timer_Stop();
    if (rx_state != 0u) {
        watchdog_rx = 1u;
    }
}

CY_ISR(isr_Timer_1)
{
    (void)Timer_1_ReadStatusRegister();
    Timer_1_Stop();
    if (g_timer1_remaining_counts != 0u) {
        timer1_start_next_chunk();
        return;
    }

    if (g_timer1_mode == TIMER1_MODE_BOOT_PING) {
        g_boot_ping_due = 1u;
        g_timer1_mode = TIMER1_MODE_NONE;
    } else if (g_timer1_mode == TIMER1_MODE_IDLE_PING) {
        g_idle_ping_due = 1u;
        g_idle_ping_armed = 0u;
        g_timer1_mode = TIMER1_MODE_NONE;
    } else if (g_timer1_mode == TIMER1_MODE_CAL_TICK) {
        g_timer1_mode = TIMER1_MODE_NONE;
        if (g_cal_timer_active) {
            g_cal_progress_due = 1u;
            if (g_cal_watchdog_remaining_ms <= g_cal_progress_period_ms) {
                g_cal_watchdog_remaining_ms = 0u;
                g_cal_watchdog_due = 1u;
                g_cal_timer_active = 0u;
            } else {
                g_cal_watchdog_remaining_ms -= g_cal_progress_period_ms;
                g_timer1_mode = TIMER1_MODE_CAL_TICK;
                g_timer1_remaining_counts = timer_ms_to_counts(g_cal_progress_period_ms);
                timer1_start_next_chunk();
            }
        }
    } else {
        g_timer1_mode = TIMER1_MODE_NONE;
    }
}

CY_ISR(isr_Timer_2)
{
    (void)Timer_2_ReadStatusRegister();
    Timer_2_Stop();
    if (g_timer2_remaining_counts != 0u) {
        timer2_start_next_chunk();
        return;
    }

    if (g_timer2_mode == TIMER2_MODE_BOOT_LED_OFF) {
        g_boot_led_off_due = 1u;
    } else if (g_timer2_mode == TIMER2_MODE_WAIT) {
        g_timer2_wait_done = 1u;
    } else if (g_timer2_mode == TIMER2_MODE_COMM_BLINK) {
        g_comm_blink_due = 1u;
    } else if (g_timer2_mode == TIMER2_MODE_CAPTURE_WD) {
        g_capture_wd_due = 1u;
    }
    g_timer2_mode = TIMER2_MODE_NONE;
}

CY_ISR(isr_SyncIn)
{
    uint8 saved;
#if defined(SYNC_IN_INTSTAT)
    (void)SYNC_IN_ClearInterrupt();
#endif
    if (SYNC_IN_Read())
    {
        uart_send_diag(PSOC_EVT_SYNC_RISE, g_state);
        if (g_state == PSOC_ARMED)
        {
            psoc_enter_sampling(g_debug_psoc);
        }
    }
    else
    {
        uart_send_diag(PSOC_EVT_SYNC_FALL, g_state);
        ADC_StopConvert();
        capture_watchdog_stop();
        idle_ping_schedule();
        saved = CyEnterCriticalSection();
        capture_reset_locked(capture_target_batches());
        g_state = PSOC_IDLE;
        CyExitCriticalSection(saved);
    }
}

/* IRQ único de superMaquina. Fast path: una sola lectura de status y el
 * handler de muestra vigente; el resto (fin de captura, error, botón) va por
 * el camino lento, que ocurre a lo sumo unas pocas veces por captura. */
CY_ISR(isr_SuperMaquina_Handler)
{
    uint8 st = status_Read();

    if ((st & (CE_STATUS_DONE | CE_STATUS_ERROR | CE_STATUS_BUTTON)) == 0u)
    {
        g_sm_sample_handler();
        return;
    }

    g_ce_status = st;

#if PSOC_BUTTON_CAL_ENABLE
    if ((st & CE_STATUS_BUTTON) != 0u)
    {
        g_cal_button_pressed = 1u;
        capture_engine_clear_flags();
        if ((st & (CE_STATUS_DONE | CE_STATUS_ERROR)) == 0u)
        {
            /* El botón puede coincidir con una muestra de bypass (calibración
             * en curso): no perderla. */
            g_sm_sample_handler();
            return;
        }
    }
#endif

    if ((st & CE_STATUS_ERROR) != 0u)
    {
        g_ce_error = error_Read();
        g_sm_sample_handler = sm_sample_noop;
        if (g_state != PSOC_SAMPLING) {
            g_state = PSOC_SAMPLING;   /* canaliza el cierre por service_runtime */
        }
        g_capture_done = 1u;
        uart_send_diag(PSOC_EVT_CAPTURE_DONE, g_ce_error);
        return;
    }

    if ((st & CE_STATUS_DONE) != 0u)
    {
        /* La última muestra del último lote llega junto con DONE. */
        g_sm_sample_handler();
        g_sm_sample_handler = sm_sample_noop;
        if (g_state == PSOC_ARMED) {
            g_state = PSOC_SAMPLING;
        }
        g_capture_done = 1u;
    }
}

CY_ISR(isr_Button_Handler)
{
#ifdef CY_ISR_isr_Button_H
    isr_Button_ClearPending();
#endif
#if PSOC_BUTTON_CAL_ENABLE
    g_cal_button_pressed = 1u;
#endif
}

/* ── Trampas de robustez ─────────────────────────────────────────────────────
 * 1) isr_SyncIn: calibration.c la deshabilita/rehabilita alrededor de una
 *    corrida (cal_async_complete). Con PSOC_SUPERMAQUINA_OWNS_SYNC_IRQ el
 *    vector nunca se instalaba, así que ese re-enable dejaba la NVIC apuntando
 *    a IntDefaultHandler (while(1)): el siguiente flanco de SYNC_IN congelaba
 *    el equipo. Se instala SIEMPRE un vector seguro.
 * 2) Cualquier IRQ que siga apuntando a IntDefaultHandler se re-vector a un
 *    trap que reporta el número de IRQ por UART (EVT 0x7E) y la deshabilita,
 *    en vez de colgar el firmware.
 * 3) HardFault (EVT 0x7F) queda en loop parpadeando el LED rápido. */
static void led_write(uint8 value);

CY_ISR(isr_SyncIn_SafeVector)
{
#if defined(SYNC_IN_INTSTAT)
    (void)SYNC_IN_ClearInterrupt();
#endif
}

extern void IntDefaultHandler(void);

CY_ISR(unexpected_irq_trap)
{
    uint32 vecactive = CY_GET_REG32((reg32 *)0xE000ED04u) & 0x1FFu;
    uint8 irq_n = (uint8)((vecactive >= 16u) ? (vecactive - 16u) : 0xFFu);
    if (irq_n < CY_NUM_INTERRUPTS) {
        CyIntDisable(irq_n);
    }
    uart_send_diag(0x7Eu, irq_n);
}

CY_ISR(hardfault_trap)
{
    uart_send_diag(0x7Fu, 0u);
    for (;;)
    {
        led_write(0u);
        CyDelay(60u);
        led_write(1u);
        CyDelay(60u);
    }
}

static void install_irq_traps(void)
{
    uint8 i;
    for (i = 0u; i < CY_NUM_INTERRUPTS; i++) {
        if (CyIntGetVector(i) == (cyisraddress)IntDefaultHandler) {
            (void)CyIntSetVector(i, unexpected_irq_trap);
        }
    }
    (void)CyIntSetSysVector(3u, hardfault_trap); /* HardFault */
}

