simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
static void led_write(uint8 value)
{
#ifdef CY_PINS_LED_H
    LED_Write(value);
#else
    (void)value;
#endif
}

static void led_toggle(void)
{
#ifdef CY_PINS_LED_H
    if (g_state != PSOC_SAMPLING) {
        LED_Write(LED_Read() ^ 0x01u);
    }
#endif
}

static void comm_led_start_identify(void)
{
    g_comm_led_active = 1u;
    g_comm_blinks_remaining = (uint16)IDENTIFY_BLINK_TOGGLES;
    g_comm_blink_due = 0u;
    led_write(1u);
    timer2_arm_ms(COMM_BLINK_MS, TIMER2_MODE_COMM_BLINK);
}

static void idle_ping_service(void)
{
    if (!g_idle_ping_armed && !g_idle_ping_due) {
        idle_ping_schedule();
    }
    if (g_idle_ping_due) {
        g_idle_ping_due = 0u;
        uart_send_ping();
        idle_ping_schedule();
    }
}

uint32 psoc_now_ticks(void)
{
    return 0u; /* Compatibilidad para el servo legacy, hoy compilado apagado. */
}

/* Selecciona la ruta en superMaquina. Con ENGINE_ENABLE=0 actúa como bypass
 * para calibración/diagnóstico; con ENGINE_ENABLE=1 decide qué DRQ deja pasar
 * durante captura. Instala además el handler de muestra de bypass que publica
 * la muestra alineada para calibration.c. */
void dma_route_select(uint8 use_filter)
{
    capture_engine_set_source(capture_engine_source_from_stream(use_filter));
    g_sm_sample_handler = (use_filter != 0u) ? sm_sample_cal_filt
                                             : sm_sample_cal_raw;
}

static uint8 psoc_seed_calibration_from_nv(uint8 reset_defaults_if_missing)
{
    uint8 nv_dac[PSOC_NV_CAL_STAGES];
    uint8 stage_count = psoc_calibration_stage_count();

    if (!g_nv_ready || stage_count == 0u || stage_count > PSOC_NV_CAL_STAGES) {
        return 0u;
    }

    if (psoc_nv_load_for_gain(g_pga_code, nv_dac, stage_count)) {
        psoc_calibration_seed_dac(nv_dac, stage_count);
        return 1u;
    }

    if (reset_defaults_if_missing) {
        psoc_calibration_seed_default_dac();
    }
    return 0u;
}

static void PGAgain_Set(uint8 code)
{
    if (code <= 8u) {
        uint8 changed = (g_pga_code != code) ? 1u : 0u;
        g_pga_code = code;
        psoc_hw_set_pga(code);
        if (changed) {
            g_last_calibration_ok = 0u;
            (void)psoc_seed_calibration_from_nv(1u);
        }
    }
}

static void PGAvdac_Set(uint8 code)
{
    if (code <= 8u) {
        g_pgavdac_code = code;
        psoc_hw_set_pgavdac(code);
    }
}

/* Lotes extra a pedirle a superMaquina en captura filtrada armada, para que
 * tras descartar las 63 muestras de retardo de grupo el buffer igual reciba
 * los 30*N puntos pedidos: ceil(63/30) = 3. */
#define CAPTURE_FILTER_EXTRA_BATCHES \
    ((uint16)((FILTER_GROUP_DELAY + BATCH_SAMPLES - 1u) / BATCH_SAMPLES))

static void psoc_arm(void)
{
    uint8 saved;
    uint8 source;
    uint16 stored_target = capture_target_batches();
    uint16 hw_target;
    uint16 discard = 0u;

    psoc_prepare_capture_path();
    source = capture_engine_source_from_stream(g_stream_mode);
    hw_target = stored_target;
    if (source == CE_CFG_SRC_FILTER || source == CE_CFG_SRC_COMBINED) {
        /* Ruta filtrada armada: superMaquina mantiene el FIR alimentado en
         * ARMED (historia caliente) y el ARM descarta las primeras 63 salidas
         * tras el sync; asi la primera muestra almacenada corresponde al
         * instante del sync, alineada con la ruta raw. El objetivo del
         * hardware se extiende para cubrir el descarte. */
        discard = FILTER_GROUP_DELAY;
        if (stored_target > (uint16)(PSOC_CAPTURE_MAX_BATCHES - CAPTURE_FILTER_EXTRA_BATCHES)) {
            stored_target = (uint16)(PSOC_CAPTURE_MAX_BATCHES - CAPTURE_FILTER_EXTRA_BATCHES);
            uart_send_diag(PSOC_EVT_CAPTURE_CLAMPED, diag_u16_sat(capture_target_batches()));
        }
        hw_target = (uint16)(stored_target + CAPTURE_FILTER_EXTRA_BATCHES);
    }
#if PSOC_RAMP_DEBUG_ENABLE
    g_capture_align = (source == CE_CFG_SRC_DEBUG) ? 0u : 1u;
#else
    g_capture_align = 1u;
#endif
    saved = CyEnterCriticalSection();
    capture_reset_locked(stored_target);
    g_fir_discard = discard;
    g_state = PSOC_ARMED;
    CyExitCriticalSection(saved);
    capture_engine_configure_target(hw_target);
    capture_engine_set_source(source);
    g_sm_capture_handler = capture_handler_for_source(source);
    g_sm_sample_handler = sm_sample_armed_wait;
    capture_engine_set_enabled(1u, 1u);
    capture_engine_clear_flags();
    capture_engine_pulse(CE_CTRL_ARM);
    ADC_StartConvert();
    uart_send_diag(PSOC_EVT_ARMED, diag_u16_sat(g_n_batches));
}

static void psoc_start_now(void)
{
    psoc_prepare_capture_path();
    psoc_enter_sampling(0u);
}

static uint8 psoc_start_calibration_if_idle(uint8 send_ack)
{
    uint8 cal_start;

    if (g_state != PSOC_IDLE) {
        uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
        }
        return 0u;
    }
    g_batches_sent = 0u;
    g_batches_captured = 0u;
    g_capture_done = 0u;
    g_last_calibration_ok = 0u;
    uart_send_diag(PSOC_EVT_BOOT, 0xA1u);  /* BREADCRUMB temporal */
    psoc_calibration_servo_abort();
    idle_ping_stop();
    comm_led_stop();
    uart_send_diag(PSOC_EVT_BOOT, 0xA2u);  /* BREADCRUMB temporal */
    capture_engine_set_enabled(0u, 0u);
    capture_engine_clear_flags();
    uart_send_diag(PSOC_EVT_BOOT, 0xA3u);  /* BREADCRUMB temporal */
    /* La ruta del DMA (raw vs Filter) y el AMux los gobierna cal_pi_stage_begin
     * (calibration.c) por etapa -- no hace falta forzar nada aca. */
    uart_send_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
    uart_send_diag(PSOC_EVT_CAL_START, 0u);
    cal_start = psoc_calibration_start_async();
    if (cal_start == 2u) {
        g_last_calibration_ok = 1u;
        idle_ping_schedule();
        dma_route_select(g_stream_mode);
        uart_send_diag(PSOC_EVT_CAL_DONE, 1u);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 1u);
        }
        return 1u;
    }
    if (!cal_start) {
        uart_send_diag(PSOC_EVT_CAL_DONE, 0u);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
        }
        return 0u;
    }
    g_cal_ack_pending = send_ack ? 1u : 0u;
    g_state = PSOC_CALIBRATING;
    return 1u;
}

static void psoc_report_adc_snapshot_if_idle(void)
{
    if (g_state != PSOC_IDLE) {
        uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
        uart_send_cfg_ack(PSOC_CMD_ADC_SNAPSHOT, 0u);
        return;
    }

