simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
#if PSOC_TX1_BITBANG_TEST
    CyPins_SetPinDriveMode(Tx_1__0__PC, PIN_DM_STRONG);
    tx1_manual_write(1u);
    for (;;)
    {
        led_toggle();
        tx1_bitbang_byte(0xABu);
        tx1_bitbang_byte(0xC0u);
        tx1_bitbang_byte(0x00u);
        tx1_bitbang_byte(0xC0u);
        CyDelay(100u);
    }
#endif

    UART_Start();
    psoc_debug_start();
    psoc_debug_print("\r\n[PC] boot\r\n");
    psoc_debug_print_u32("[PC] PSOC_HW_CLASS=", PSOC_HW_CLASS);
    psoc_debug_print_u32("[PC] PSOC_CAL_STAGE_COUNT=", psoc_calibration_stage_count());
    psoc_calibration_set_diag_hook(uart_send_diag);

#if PSOC_EARLY_UART_TEST
    for (;;)
    {
        led_toggle();
        uart_send_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
        uart_send_ping();
        CyDelay(100u);
    }
#endif

    uart_send_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);

    EEPROM_Start();
    g_nv_ready = 1u;

    psoc_hw_start_analog(g_pga_code, g_pgavdac_code);
    /* Arranca todos los VDAC de calibracion en su adelanto/feedforward de
     * tabla. Si EEPROM tiene una calibracion valida, se pisa justo abajo con
     * esos valores guardados para ahorrar aun mas tiempo. */
    psoc_calibration_start_references();

    /* Siempre arranca con el ultimo slot EEPROM de la ganancia actual.
     * Si no hay slot valido, deja explicitamente los adelantos nominales. */
#if PSOC_LOAD_NV_CAL_ON_BOOT
    (void)psoc_seed_calibration_from_nv(1u);
#endif

    Filter_Start();
    /* Activa el FIR de adquisicion (FIR_adquisition.h) -- calibration.c
     * carga el de calibracion (FIR_calibration.h) solo durante una corrida
     * y restaura este al terminar (ver cal_pi_start/cal_async_complete). */
    (void)psoc_filter_load_fir_coefficients(g_fir_adquisition_coeffs_q23, FILTER_FIR_NTAPS);
    dma_adc_init();
    capture_engine_reset_hw();
    capture_engine_set_enabled(0u, 0u);
    dma_route_select(0u);

    psoc_prepare_capture_path();
    uart_send_diag(PSOC_EVT_ANALOG_READY, 0u);

#if !PSOC_SUPERMAQUINA_OWNS_DMA_IRQ
#ifdef CY_ISR_isr_DMA_DelSig_RAM_H
    isr_DMA_DelSig_RAM_StartEx(isr_DMA_DelSig_RAM_Handler);
#endif
#ifdef CY_ISR_isr_DMA_Filter_RAM_H
    isr_DMA_Filter_RAM_StartEx(isr_DMA_Filter_RAM_Handler);
#endif
#endif
    fixed_timers_init();
    isr_Timer_StartEx(isr_Timer);
    isr_Timer_1_StartEx(isr_Timer_1);
    isr_Timer_2_StartEx(isr_Timer_2);
    /* isr_Timer_3 ya no se registra: Timer_3 quedó libre (ver mapa arriba). */
#if !PSOC_SUPERMAQUINA_OWNS_SYNC_IRQ
#ifdef CY_ISR_isr_SyncIn_H
    isr_SyncIn_StartEx(isr_SyncIn);
#endif
#endif
    isr_SuperMaquina_StartEx(isr_SuperMaquina_Handler);
    Clock_1_Start();
#if PSOC_BUTTON_CAL_ENABLE
#ifdef CY_ISR_isr_Button_H
    isr_Button_ClearPending();
    isr_Button_StartEx(isr_Button_Handler);
#endif
#endif

    /* ── Loop de arranque: busca el ESP sin bloquear UART/ADC ───────────── */
    wait_for_esp();
    psoc_calibration_servo_enable(0u);

    /* ── 5 parpadeos rápidos al conectar ─────────────────────────────────── */
    for (i = 0u; i < 5u; i++)
    {
        led_write(0u); wait_ms_timer2(CONNECT_BLINK_MS);
        led_write(1u); wait_ms_timer2(CONNECT_BLINK_MS);
    }
    idle_ping_schedule();

    /* ── Loop principal ─────────────────────────────────────────────────── */
    for (;;)
    {
        if (service_button_calibration()) {
            continue;
        }
        service_runtime();

        if (g_state == PSOC_SAMPLING || capture_dump_pending()) {
            idle_ping_stop();
            continue;   /* Sin LED ni pings durante captura y volcado */
        }

        if (g_state == PSOC_IDLE && !capture_dump_pending()) {
            (void)psoc_calibration_servo_service();
            idle_ping_service();
        } else {
            idle_ping_stop();
        }

        service_comm_led();
    }
}

/* [] END OF FILE */
